# SetLineStyleId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegion..::..SetLineStyleId Method
FilledRegion Class See Also
---
Sets the line style Id for all boundaries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetLineStyleId(
	ElementId lineStyleId
)
```

Visual Basic
---
```text
Public Sub SetLineStyleId ( _
	lineStyleId As ElementId _
)
```

Visual C++
---
```text
public:
void SetLineStyleId(
	ElementId^ lineStyleId
)
```

# ### Parameters
lineStyleId
    Type: Autodesk.Revit.DB..::..ElementId The line style Id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | lineStyleId is not a valid line style Id for a filled region. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilledRegion Class
Autodesk.Revit.DB Namespace